Repository: tvallois/code
Catalog: po/extra/*.po
Languages: cs, de

source: The editor that works for you
cs: Editor, který pracuje pro vás
de: Der Editor, der für Sie arbeitet

source: Whether you're writing in Markdown or managing a complex app codebase, Code is the lightweight but full-featured editor for you. It auto-saves your files to ensure they're always up-to-date, and it remembers your tabs so you never lose your spot—even between sessions.
cs: Automaticky ukládá soubory, aby byli vždy aktuální. Pamatuji si také otevřené panely, abyste se už nikdy neztratili, ani při přepínání několika sezení. Automaticky ukládá soubory, aby bylo zajištěno, že jsou aktuální a pamatuje si otevřené panely, takže nikdy neztratíte své soustředění – ani mezi relacemi.
de: Ob Sie in Markdown schreiben oder eine komplexe Anwednungs-Codebasis managen - Code ist der schlanke und dennoch funktionsreiche Editor für Sie. Er speichert Ihre Dateien ganz automatisch, so dass diese immer auf dem aktuellen Stand sind. Außerdem merkt sich Code, welche Tabs Sie geöffnet hatten, sodass Sie nie den Faden verlieren. Sogar über mehrere Sitzungen hinweg.

source: Designed around a project-based workflow, Code knows about your separate codebases. It comes with helpful Git integration to create and switch between branches and show changed files and lines within your projects.
cs: Navrženo kolem projektového způsobu práce, Code ví o oddělených zdrojových kódech. Přichází s nápomocným napojením na Git pro vytváření a přepínání mezi větvemi a zobrazuje změněné soubory a řádky v rámci projektů.
de: Da er um einen projektbasierten Workflow herum designt ist, weiß Code um Ihre separierten Codebases. Er beinhaltet hilfreiche Git-Integration um Branches zu erstellen und zwischen ihnen zu wechseln. Er zeigt ausserdem geänderte Dateien und Zeilen innerhalb ihrer Projekte an.

source: Work with your language: whether you're crafting code in Vala, scripting with PHP, or marking things up in HTML, Code has you covered. Experience full syntax highlighting with nearly all programming, scripting, and markup languages.
cs: Umí pracovat s vaším jazykem: ať už vytváříte kód ve Vale, skriptujete v PHP, nebo značkujete pomocí HTML, Code je tu pro vás. Jistě oceníte plné zvýrazňování syntaxe s téměř všemi programovacími, skriptovacími a značkovacími jazyky.
de: Arbeiten Sie mit der Programmiersprache Ihrer Wahl: Ob Sie in Vala programmieren, PHP-Code schreiben oder Text in HTML verfassen – Code deckt all Ihre Anforderungen ab. Erleben Sie, wie Code in fast allen Programmier-, Skript- und Markup-Sprachen die perfekte Syntax-Hervorhebung beherrscht.

source: Find anything in your current file, specific folders, or your whole project with options for case-sensitivity and regular expressions.
cs: Najděte cokoli v právě otevřeném souboru, konkrétních složkách nebo v celém projektu pomocí voleb pro (ne)rozlišování mezi malými/VELKÝMI písmeny a regulárních výrazů.
de: Finden Sie alles in Ihrer aktuellen Datei, Ordnern oder Ihrem ganzen Projekt mit Optionen für Groß/Kleinschreibung und reguläre Ausdrücke.

source: Smart features throughout: automatic indentation, smart cut/copy behavior, visible whitespace for selected text and at the end of lines by default, and optional extensions for Markdown actions, spell checking, whitespace trimming, word completion, and more.
cs: Přehlídka chytrých funkcí: automatické odsazování, inteligentní chování vyjmutí/zkopírování, ve výchozím stavu viditelné prázdné znaky (whitespace) pro označený text a na konci řádku a volitelná rozšíření pro akce ohledně Markdown, kontrola překlepů, ořezávání prázdných znaků, dokončování slov a další.
de: Smarte Funktionen durch und durch: Automatisches Einrücken, smartes Ausschneiden/Kopieren, standardmäßig sichtbare Leerstellen für markierten Text und am Ende von Zeilen und optionale Erweiterungen für Markdown-Aktionen, Rechtschreibprüfung, Leerstellen-Trimmen, Wortkomplettierungen und vieles mehr.

source: Adapt Code to your workflow: you can tweak the behavior and interface as needed with a handful of useful and well-considered extensions and preferences.
cs: Upravte si Code podle stylu své práce: je možné vyladit chování rozhraní dle potřeby pomocí mnoha užitečných a promyšlených rozšíření a předvoleb.
de: Passen Sie Code an Ihren Workflow an: Sie können das Verhalten und die Oberfläche mit einer Handvoll nützlichen und speziell designten Erweiterungen ganz nach Ihren Bedürfnissen anpassen.

source: There's a ton more:
cs: A je toho mnohem více:
de: Und es gibt noch eine Menge mehr:

source: Solarized Light, Solarized Dark, and High Contrast color schemes that affect the whole UI
cs: Schémata barev Solarized Light, Solarized Dark, a Vysoký kontrast, která se týkají celého uživatelského rozhraní
de: Solarized Light, Solarized Dark und High Contrast Farbschemata, die die komplette Oberfläche beeinflussen

source: Togglable sidebar to fit your workflow
cs: Volitelný postranní panel, který zapadá do vašeho způsobu práce
de: An- und ausschaltbare Seitenleiste um Ihrem Workflow zu entsprechen

source: Smart indentation and .editorconfig support
cs: Chytré odsazování a podpora standardu .editorconfig
de: Smartes Einrücken und .editorconfig Unterstützung

source: Browser-class tabs with drag-and-drop, duplication, undo closing, and tab history
cs: Panely jako ve webovém prohlížeči, které je možné přesouvat, duplikovat, brát zpět zavření a také jejich historie
de: Browserartiges Tabverhalten mit Drag & Drop, Duplizieren, Schließen-rückgängig-Funktion und Tab-Verlaufsfunktion

source: Display the current line and character—and quickly jump to a new line
cs: Zobrazit stávající řádek jako znak – a rychle skočit na nový řádek
de: Anzeigen der aktuellen Zeile und Zeichen — und schnelles Springen zu einer neuen Zeile

source: Scroll past the end of the file so you can keep the current line where it's comfortable
cs: Posunování za konec souboru, takže je možné ponechat stávající řádek tam, kde je to pohodlné
de: Über das Ende der Datei hinaus scrollen, um die aktuelle Zeile dort zu sehen, wo es bequem ist

source: Optional mini-map to make navigating large files easier
cs: Volitelná minimapa, která usnadňuje pohyb po větších souborech
de: Optionale Mini-Map um das Navigieren in großen Dateien zu vereinfachen

source: Improvements:
cs: Vylepšení:
de: Verbesserungen:

source: Fixes:
cs: Opravuje:
de: Fehlerbehebungen:

source: Minor updates:
cs: Drobné aktualizace:
de: Weitere Aktualisierungen:

source: Updated translations
cs: Aktualizovány překlady
de: Aktualisierte Übersetzungen

source: Projects with the same name now include their parent folder name as well
cs: Projekty, které jsou nazvané stejně, jsou nyní rozlišovány pomocí své nadřazené složky

source: When scrolling to search results, overshoot slightly for better visibility
cs: Při posouvání k výsledkům hledání, je zlepšena jejich viditelnost

source: Use the FileChooser portal instead of the one from GTK
cs: Použit portál FileChooser namísto toho z GTK

source: Center the global search dialog over the main Code window
cs: Vystředěn dialog globálního vyhledávání nad hlavním oknem s Code

source: Fix visibility of Terminal button on Welcome page
cs: Opravena viditelnost tlačítka terminálu na uvítací stránce
de: Sichtbarkeit des Terminal-Buttons auf der Willkommensseite sicherstellen

source: Fix some keyboard shortcuts affecting unfocused Document instead of focused Terminal
cs: Opraveny některé klávesové zkratky týkající se nezaměřeného dokumentu namísto zaměřeného terminálu
de: Behebt einen Fehler, bei dem einige Tastenkürzel ihren Effekt auf ein nicht ausgewähltes Dokument statt des gewählten hatten

source: Close Terminal if shell exited and create new Terminal if re-opened with no shell
cs: Pokud shell skončil, terminál je zavřen a při opětovném otevření také znovu otevřen

source: "Visible whitespace" combobox is now a switch
cs: Kombinovaná nabídka „Viditelné prázdné znaky“ je nyní přepínač

source: Fix crash when creating new window from tab drop
cs: Opraven pád při vytváření nového okna z rozbalovací nabídky karty
de: Behebt einen Fehler beim Öffnen neuer Fenster durch das Ablegen eines Tabs

source: Ensure files created from the sidebar are automatically opened
cs: Zajištěno že soubory vytvořené z postranního panelu jsou automaticky otevřeny
de: Sicherstellen, dass über die Seitenleiste erstellte Dateien automatisch geöffnet werden

source: Hide project chooser button when hiding sidebar
cs: Přidáno tlačítko skrytí voliče projektu při skrytí postranního panelu
de: Projekt-Wahlbutton verstecken, wenn die Seitenleiste versteckt wird

source: Ensure all copy is translatable
cs: Zajištěno že jsou překladatelné veškeré kopie
de: Sicherstellen, dass Copytext übersetzbar ist

source: New features:
cs: Nové funkce:
de: Neue Funktionen:

source: New Markdown plugin for WYSIWYG-like editing.
cs: Nový zásuvný modul Markdown pro interaktivní (WYSIWYG) upravování.
de: Neues Markdown-Plugin für WYSIWYG-ähnliche Textbearbeitung.

source: Switch Git branches or create new ones in project folder context menus
cs: Přepínejte mezi větvemi v git nebo vytvářejte nové v kontextových nabídkách složky projektu
de: Git Zweige direkt im Projektordner-Kontextmenü wechseln oder erstellen

source: Show Git diff status in source view gutters
cs: Zobrazujte stav git diff v gutters zobrazení zdroje
de: Zeige Git diff status in der Quellcodeansicht-Seitenleiste

source: Full text search within project folder.
cs: Plnotextové vyhledávání v rámci složky projektu.
de: Volltextsuche im Projektordner.

source: Save and restore cursor position between sessions
cs: Ukládána a obnovována pozice kurzoru z minulé relace
de: Sichern und Wiederherstellen der Cursorposition zwischen Sessions

source: Close files from a project when that project is closed
cs: Zavírání souborů z projektu když je takový projekt zavřen
de: Projektdaten schliessen wenn das Projekt geschlossen wird

source: Show full file path in tab tooltips
cs: Zobrazován úplný popis umístění souboru v bublinové nápovědě panelu
de: Zeige vollständigen Dateipfad in den Tab Tooltips

source: Clear lines with Ctrl + K
cs: Vymazání řádek pomocí Ctrl+K
de: Zeilen löschen mit Strg + K

source: Allow Spell Checker extension in Markdown files
cs: Umožnit rozšíření pro kontrolu překlepů v souborech Markdown
de: Erweiterung der Rechtschreibprüfung in Markdown-Dateien erlauben

source: Improve multi-line duplication
cs: Vylepšeno zdvojování vícero řádků
de: Duplizieren von mehreren Zeilen verbessert

source: Remember whether the sidebar is open
cs: Zapamatováno, zda je postranní panel otevřen
de: Merken, ob die Seitenleiste geöffnet ist

source: Set window title to the focused file
cs: Titulek okna nastavován na zaměřený soubor
de: Namen der aktiven Datei als Fenstertitel setzen

source: Add keyboard shortcuts for next and previous documents
cs: Přidány klávesové zkratky pro následující a předchozí dokumenty
de: Hinzufügen von Tastaturkürzeln für nächste und vorhergegangene Dokumente

source: Show full document path in tab tooltip
cs: Zobrazen úplný popis umístění dokumentu v bublinové nápovědě panelu
de: Vollen Dokumentenpfad im Tab Tooltip anzeigen

source: Update Pastebin plugin
cs: Aktualizován zásuvný modul pro Pastebin
de: Aktualisieren des Pastebin-Plugins

source: Correctly indent last line when using the preserve whitespace plugin
cs: Správné odsazování posledního řádku při použití zásuvného modulu pro zachovávání prázdných znaků
de: Letzte Zeile korrekt Einrücken, wenn das preserve whitespace-Plugin benutzt wird

source: Keep syntax highlighting when duplicating a file
cs: Při zduplikování souboru ponecháno zvýraznění syntaxe
de: Syntax-Hervorhebung beibehalten wenn eine Datei dupliziert wird

source: Expand a collapsed folder if you attempt to open it twice
cs: Rozbalení sbalené složky při pokusu o její otevření dvakrát
de: Zugeklappten Ordner aufklappen wenn zweimal versucht wird ihn zu öffnen

source: Fix an issue where searches are lost when Code loses focus
cs: Opraven problém se ztrácením výsledků když okno Code ztratí zaměření
de: Behebt einen Fehler, bei dem Suchvorgänge verloren gehen wenn Code nicht mehr das aktive Fenster ist

source: Start Vim plugin in command mode
cs: Spouštění zásuvného modulu Vim v příkazovém režimu
de: Starte Vim plugin im Command-Mode

source: Fix and add new Vim commands
cs: Opraveny stávající a přidány nové Vim příkazy
de: Neue Vim Kommandos hinzugefügt und Fehler behoben

source: Show project folders with a hidden root folder
cs: Zobrazeny složky projektů se skrytou kořenovou složkou
de: Zeige Projektordner bei verstecktem Root-Ordner

source: Allow launching with pkexec and disallow launching with sudo
cs: Umožněno spouštění prostřednictvím pkexec a znemožněno spouštění prostřednictvím sudo
de: Gestatte den Start mit pkexec und verbiete den Start mit sudo

source: Remove split view
cs: Odebráno rozdělené zobrazení
de: Split View entfernt

source: Remove browser preview
cs: Odebrán náhled prohlížeče
de: Browservorschau entfernt

source: Fix empty sidebar layout, ensuring folders can always be added
cs: Opraveno prázdné rozvržení postranního panelu, což zajišťuje že složky je možné vždy přidat
de: Korrektur des leeren Layouts der Seitenleiste, um sicherzustellen, dass Ordner jederzeit hinzugefügt werden können

source: Scroll past the end of a file
cs: Opraveno posouvání za konec souboru
de: Bildlauf über das Ende einer Datei hinaus

source: More efficiently save and restore window position
cs: Efektivnější ukládání a obnovování pozice okna
de: Effizienteres Speichern und Wiederherstellen der Fensterposition

source: Include Git status in file tooltips
cs: Zahrnout Git stav v nástrojových tipech souborů
de: Git-Status in Datei-Tooltips anzeigen lassen

source: Option for explicit case-sensitive Find
cs: Volba pro výslovné rozlišování malých/VELKÝCH písmen při hledání
de: Option für explizite Suche unter Berücksichtigung der Groß-/Kleinschreibung

source: Other updates:
cs: Ostatní aktualizace:
de: weitere Aktualisierungen:

source: Correctly show Toggle Comment menu item when no text is selected
cs: Správné zobrazování položky nabídky přepnout komentář když není označen žádný text
de: Menüpunkt "Kommentar umschalten" korrekt anzeigen, wenn kein Text ausgewählt ist

source: Fixed font switch alignment
cs: Opraveno zarovnání přepínání fontů
de: Ausrichtung des Schriftartenschalters korrigiert

source: New "Close Other Folders" menu item to help clean up your sidebar
cs: Nová položka nabídky „Zavřít ostatní složky“ pro uklízení postranního panelu
de: Neuer Menüpunkt "Andere Ordner schließen", um Ihre Seitenleiste übersichtlicher zu gestalten

source: Save and restore cyclic search setting
cs: Ukládání a obnovování nastavení cyklického hledání
de: Speichern und Wiederherstellen der zyklischen Sucheinstellung

source: Add keyboard shortcuts to menu items
cs: Přidány klávesové zkratky k položkám nabídek
de: Hinzufügen von Tastaturkürzeln zu Menüelementen

source: Make sidebar folder items not selectable
cs: Odstranění možnosti výběru položek složky v postranním panelu
de: Sidebar-Ordner-Elemente nicht auswählbar machen

source: Center new windows
cs: Nová okna jsou vystřeďována
de: Neue Fenster zentrieren

source: Visually deprioritize .gitignored files in project sidebar
cs: Vizuálně snížena priorita souborů, označených v .gitignore v postranním panelu projektu
de: Visuelle Depriorisierung von .gitignored Dateien in der Projekt-Sidebar

source: Smart cut/copy lines with no active selection
cs: Inteligentní vyjímání/kopírování řádků bez aktivního výběru
de: Intelligentes Ausschneiden/Kopieren von Zeilen ohne aktive Auswahl

source: Add a confirmation dialog to the "Restore" action
cs: Přidána potvrzovací dialog do akce „Obnovit“
de: Bestätigungsdialog für die "Zurücksetzen"-Funktion

source: Add "Open In" menu to the top-level folder in the folder manager
cs: Přidána nabídka „Otevřít v“ ve složce nejvyšší úrovně ve správě složek
de: "Öffnen in"-Menü zum obersten Ordner im Ordnermanager hinzugefügt

source: Don't show temporary files in the folder manager
cs: Nezobrazování dočasných souborů ve správě složek
de: Temporäre Dateien im Ordnermanager nicht mehr anzeigen

source: Add brackets completion and auto-indent by default
cs: Přidání doplňování závorek a automatického odsazování ve výchozím stavu
de: Klammervervollständigung und automatische Einrückung standardmäßig hinzufügen

source: Zoom terminal plugin with keyboard
cs: Změna velikost zásuvného modulu terminálu pomocí klávesnice
de: Terminal-Plugin mit Tastatur vergrößern

source: Honor global privacy setting when saving and restoring
cs: Respektování globálního nastavení ochrany soukromí při ukládání a obnovování
de: Die globalen Datenschutzeinstellungen beim Speichern und Wiederherstellen beachten

source: Simplify "Draw spaces" preference
cs: Zjednodušení předvolby „Vykreslovat mezery“
de: Einstellung "Leerzeichen erzeugen" vereinfacht

source: Fix the keyboard shortcut for going backwards in search results
cs: Opravena klávesová zkrátka pro hledání směrem zpět
de: Die Tastenkombination für den Rückwärtslauf in den Suchergebnissen wurde korrigiert

source: Fix opening files from relative paths in Terminal
cs: Opraveno otevírání souborů z relativních popisů umístění v Terminálu
de: Korrektur beim Öffnen von Dateien aus relativen Pfaden im Terminal

source: Fix null file dialog when opening a new window via the dock
cs: Opraven prázdný dialog souboru při otevírání nového okna z doku
de: Korrektur des Nulldatei-Dialogs beim Öffnen eines neuen Fensters über das Dock

source: Add "=" as a zoom key
cs: Přidáno „=“ jako klávesa pro přiblížení
de: Hinzufügen von "=" als zusätzliche Zoomtaste

source: Change search entry icon when results aren't found
cs: Změna ikony zadávání vyhledávání když nejsou nalezeny výsledky
de: Sucheingabe-Symbol wird verändert, wenn keine Ergebnisse gefunden werden

source: Enter name of new file before creating it
cs: Zadání názvu souboru před jeho vytvářením
de: Den Namen einer neuen Datei vor dem Erstellen eingeben

source: Use Granite.MessageDialog throughout
cs: Použití Granite.MessageDialog po celou dobu
de: Verwendet Granite.MessageDialog durchgängig

source: Include non-text files in sidebar
cs: Zahrnutí souborů s jiným než textovým obsahem do postranního panelu
de: Einbeziehung von Nicht-Text-Dateien in die Seitenleiste

source: Fix Remove Current View
cs: Opraveno odebrání stávajícího pohledu
de: Fix "Aktuelle Ansicht entfernen"

source: Fix New Window desktop action behavior
cs: Opraveno chování akce desktopu Nové okno
de: Fix für das Verhalten der Desktop-Aktion *Neues Fenster"

source: Properly synchronize Ctrl+N key presses with number of new documents spawned
cs: Správná synchronizace stisků Ctrl+N a počtu nových vytvořených dokumentů
de: Richtige Synchronisierung bei der Eingabe von Strg+N mit der Anzahl der neu erstellten Dokumente

source: Build system fix for editorconfig dependency
cs: Oprava systému pro sestavování pro závisení na editorconfig
de: Erstellung eines System-Fixes für die Abhängigkeit von editorconfig

source: Add Change Branch context menu item
cs: Přidána položka kontextové nabídky Změnit větev
de: Kontextmenüeintrag "Branch ändern" hinzugefügt

source: Avoid possible startup crash related to how plugins load
cs: Vyhnutí se možnému pádu při spouštění souvisejícího s tím, jak jsou načítány zásuvné moduly
de: Vermeidung eines möglichen Absturzes beim Start in Verbindung mit dem Laden von Plugins

source: Smarter file saving behavior
cs: Inteligentnější chování ukládání souborů
de: Intelligenteres Verhalten beim Speichern von Dateien

source: File saving fixes
cs: Opravy ukládání souborů
de: Fehlerbehebungen beim Speichern von Dateien

source: Don't add temporary files to tab restore
cs: Nepřidávat dočasné soubory do obnovení karty
de: Temporären Dateien werden nicht mehr zur Wiederherstellung von Tabs zugelassen

source: Don't recreate deleted files when restoring session
cs: Nevytvářet znovu smazané soubory při obnovování relace
de: Gelöschte Dateien werden bei Wiederherstellen der Sitzung nicht neu erstellt

source: Restore line wrap preference
cs: Obnovení předvoleb zalamování řádek
de: Einstellung für Zeilenumbruch wiederhergestellt

source: Add accel tooltips
cs: Přidání nástrojových tipu accel
de: Tooltips hinzugefügt

source: Minor bug fixes
cs: Opravy drobných chyb
de: Kleinere Fehlerbehebungen

source: Edit code files
cs: Upravujte soubory se zdrojovými kódy
de: Code Editor

source: Code Editor
cs: Editor kódu

source: New File
cs: Nový soubor
de: Neue Datei

source: New Window
cs: Nové okno
de: Neues Fenster

source: Run Code as Administrator
cs: Spustit kód jako správce
de: Code als Administrator ausführen

source: Authentication is required to run Code as Administrator
cs: Pro spouštění Code s oprávněními správce systému je zapotřebí ověření
de: Um Code als Administrator auszuführen ist eine Authentifizierung erforderlich

source: text;IDE;scratch;
de: Text;Entwicklungsumgebung;IDE;Code;
