Repository: tvallois/code
Catalog: po/plugins/*.po
Languages: sv

source: Brackets Completion
sv: Parentesifyllning

source: Complete brackets while typing
sv: Avsluta parenteser medan du skriver

source: Detect Indent
sv: Detektera indrag

source: Heuristically detect tab or space settings
sv: Detektera flik- eller mellanslagsinställningar heuristiskt

source: Load settings from an EditorConfig file
sv: Ladda inställningar från en EditorConfig-fil

source: Highlight Word Selection
sv: Markera ordval

source: Highlights all occurrences of words that are selected
sv: Markera alla förekomster av ord som är valda

source: Outline
sv: Kontur

source: Outline symbols in your current file for Vala
sv: Se överblick över symboler i din nuvarande Vala-fil

source: Share files with pastebin service
sv: Dela filer med pastebintjänster

source: Preserve Indent
sv: Bevara indrag

source: Maintains relative indent level of pasted text
sv: Bibehåller relativa indragsnivåer för inklistrad text

source: Spell Checker
sv: Stavningskontroll

source: Checks the spelling of your documents
sv: Kontrollera stavning i dina dokument

source: Strip trailing whitespace
sv: Rensa efterföljande mellanslag

source: Strip trailing whitespace on save
sv: Rensa efterföljande mellanslag vid sparning

source: Vim Emulation
sv: Vim-emulering

source: Words Completion
sv: Ordifyllning

source: Show a completion dialog with most used words from your files
sv: Visa en ifyllningsdialog med de vanligaste orden från dina filer
